Repository: yuminc03/pointer-quest
Catalog: PointerQuest/Localizable.xcstrings
Source language: ko
Languages: en

source: // 레슨 0: 메모리의 모든 칸에는 번호(주소)가 있어요. 값이 든 상자 3개를 눌러 확인해 보세요.
en: // Lesson 0: Every cell in memory has a number (an address). Tap the 3 boxes holding a value to inspect them.

source: // 레슨 1: 포인터를 드래그해서 0x700C 주소를 가리키세요.
en: // Lesson 1: Drag the pointer to point to address 0x700C.

source: // 레슨 2: 0x701C를 직접 가리켜도 되지만, 이미 있는 포인터(0x7014)를 가리켜 이중 포인터를 만들어보세요.
en: // Lesson 2: You can point directly at 0x701C, but try pointing at the existing pointer(0x7014) instead to create a double pointer.

source: // 레슨 3: Start(0x7000)에서 Treasure(0x703C)까지 체인을 만드세요.
en: // Lesson 3: Create a chain from Start(0x7000) to Treasure(0x703C).

source: // 실행된 연산을 C 언어 코드로 표현합니다.
en: // The executed operation is represented as C language code.

source: // 오류: 유효하지 않은 포인터입니다.
en: // Error: Invalid pointer.

source: // 잘했어요! 레슨 완료! 🎉
en: // Well done! Lesson Complete! 🎉

source: // 주소: %@
en: // Address: %@

source: // 직접 연결도 가능하지만, 지금은 이중 포인터를 연습해봐요 — 이미 있는 포인터(%@)를 가리켜보세요.
en: // A direct connection works too, but let's practice double pointers — try pointing at the existing pointer(%@) instead.

source: // 포인터는 자기 자신을 가리킬 수 없습니다. 다른 주소를 선택해 연결하세요.
en: // A pointer can't point to itself. Choose a different address to connect to.

source: // 플레이그라운드: 자유롭게 포인터를 연결해보세요. 여기선 아무것도 망가지지 않아요.
en: // Playground: Freely connect pointers. Nothing to break here.

source: 1. 블록을 길게 누르면 3D로 튀어나오는 모습을 볼 수 있어요.
en: 1. Long press a block to see it pop out in 3D.

source: 2. 다른 블록 가까이로 드래그하세요.
en: 2. Drag it close to another block.

source: 3. 손가락을 떼면 두 블록이 연결됩니다.
en: 3. Release your finger to connect the two blocks.

# int *%@ = %@; // %@ int **%@ = &%@; // 이중 포인터 (이 슬롯이 %@을 가리킴)
source: int *%1$@ = %2$@; // %3$@ int **%4$@ = &%5$@; // 이중 포인터 (이 슬롯이 %6$@을 가리킴)
en: int *%1$@ = %2$@; // %3$@ int **%4$@ = &%5$@; // Double Pointer (This slot points to %6$@)

# int %@ = %lld; int *%@ = &%@; // %@ 자신도 메모리(%@)에 저장된 값(주소)입니다.
source: int %1$@ = %2$lld; int *%3$@ = &%4$@; // %5$@ 자신도 메모리(%6$@)에 저장된 값(주소)입니다.
en: int %1$@ = %2$lld; int *%3$@ = &%4$@; // %5$@ itself is also a value (an address) stored in memory(%6$@).

# int %@ = %lld; // %@의 값
source: int %1$@ = %2$lld; // %3$@의 값
en: int %1$@ = %2$lld; // Value at %3$@

source: int %1$@ = %2$lld; // %3$@의 값 int *%4$@ = &%5$@; // %6$@이 %7$@를 가리킴 int **%8$@ = &%9$@; // 이중 포인터 (이 슬롯이 %10$@을 가리킴)
en: int %1$@ = %2$lld; // Value at %3$@ int *%4$@ = &%5$@; // %6$@ points to %7$@ int **%8$@ = &%9$@; // Double Pointer (This slot points to %10$@)

source: int %1$@ = %2$lld; // %3$@의 값 int *%4$@ = &%5$@; // 이 슬롯(%6$@)이 %7$@을 가리킴 // %8$@ 자신도 메모리(%9$@)에 저장된 값(주소)입니다.
en: int %1$@ = %2$lld; // Value at %3$@ int *%4$@ = &%5$@; // This slot(%6$@) points to %7$@ // %8$@ itself is also a value (an address) stored in memory(%9$@).

# int %@ = %lld; // 이름 %@, 주소 %@, 값 %lld
source: int %1$@ = %2$lld; // 이름 %3$@, 주소 %4$@, 값 %5$lld
en: int %1$@ = %2$lld; // name %3$@, address %4$@, value %5$lld

# int %@ = %lld; // 이름 %@, 주소 %@, 값 %lld // 아직 열어보지 않은 상자가 %lld개 남았어요.
source: int %1$@ = %2$lld; // 이름 %3$@, 주소 %4$@, 값 %5$lld // 아직 열어보지 않은 상자가 %6$lld개 남았어요.
en: int %1$@ = %2$lld; // name %3$@, address %4$@, value %5$lld // %6$lld more box(es) left to open.

# int %@; // %@의 변수가 초기화되지 않음 int *%@ = &%@; // 경고: '%@'를 역참조하면 쓰레기 값이 반환됩니다.
source: int %1$@; // %2$@의 변수가 초기화되지 않음 int *%3$@ = &%4$@; // 경고: '%5$@'를 역참조하면 쓰레기 값이 반환됩니다.
en: int %1$@; // Variable at %2$@ is uninitialized int *%3$@ = &%4$@; // Warning: Dereferencing '%5$@' yields garbage value.

source: malloc·free와 스택 vs 힙
en: malloc/free & Stack vs Heap

# printf("%%d", *%@); // 값: %lld
source: printf("%%d", *%1$@); // 값: %2$lld
en: printf("%%d", *%1$@); // Value: %2$lld

# printf("%%p", *%@); // 주소: %@
source: printf("%%p", *%1$@); // 주소: %2$@
en: printf("%%p", *%1$@); // Address: %2$@

source: 값이 아니라 '주소'가 중요합니다. 포인터를 드래그해서 주소를 가리켜보세요.
en: It's not the value, but the 'Address' that matters. Drag the pointer to point to address.

source: 구조체와 포인터
en: Structs & Pointers

source: 네, 튜토리얼 보여주세요.
en: Yes, show me the tutorial.

source: 다음 업데이트에서 만나볼 수 있어요.
en: Coming soon in a future update.

source: 데이터에 도달하는 경로를 만드세요. 순서대로 연결하세요: 시작 -> 노드 A -> 노드 B -> 보물.
en: Create a path to reach the data. Connect in order: Start -> Node A -> Node B -> Treasure.

source: 레슨
en: Lesson

source: 레슨 %lld
en: Lesson %lld

source: 레슨 완료! 🎉
en: Lesson Complete! 🎉

source: 레슨을 선택해 다음 화면으로 이동하면, 격자 모양으로 배치된 블록 화면을 보게 됩니다.
en: When you select a Lesson and enter the next screen, you will see a screen with blocks arranged in a grid.

source: 메모리는 번호가 붙은 상자들입니다. 값이 들어 있는 상자를 눌러 이름·번호·내용을 확인해 보세요.
en: Memory is a set of numbered boxes. Tap a box that holds a value to check its name, number, and contents.

source: 메모리의 미로
en: The Memory Maze

source: 목표 없이 자유롭게 탐험해 보세요.
en: No objective. Just explore.

source: 배열과 포인터 연산
en: Arrays & Pointer Arithmetic

source: 변수와 메모리
en: Variables and Memory

source: 사용 방법
en: How to use

source: 설정
en: Setting

source: 설정에서 언어를 바꾸면 앱이 다시 시작됩니다.
en: Changing the language in Settings restarts the app.

source: 아니요, 괜찮아요.
en: No, I'm good.

source: 앱 사용법
en: How to use the app

source: 언어
en: Language

source: 여기서는 자유롭게 포인터를 연결하고 해제할 수 있어요. 미션도 정답도 없으니 마음껏 탐험해 보세요.
en: Freely connect and disconnect pointers here. There's no mission or wrong answer — just explore.

source: 완료
en: Completed

source: 이 앱이 처음이신가요? 튜토리얼에서 사용법을 확인해보세요!
en: New to the app? Check out the tutorial to learn how to use it!

source: 이 화면에서는 특정 값을 가진 블록을 다른 블록으로 참조(가리키게)할 수 있습니다.
en: In this screen, you can reference a block containing a specific value with another block.

source: 이미 데이터를 가리키는 포인터가 있습니다. 새 포인터로 그 포인터를 가리켜 이중 포인터를 만들어보세요.
en: There's already a pointer pointing to the data. Point a new pointer at that pointer to create a double pointer.

source: 이중 포인터 심화
en: Advanced Double Pointers

source: 주소가 중요한 이유
en: The Importance of Address

source: 주소와 포인터
en: Address & Pointers

source: 준비 중
en: Coming Soon

source: 징검다리 포인터
en: Stepping Stone Pointer

source: 참조됨
en: Referenced

source: 챕터 %lld
en: Chapter %lld

source: 체인 연결
en: Chain Connection

source: 튜토리얼은 설정 > 앱 사용법에서 다시 확인할 수 있습니다.
en: You can check the tutorial again in Setting > How to use the app.

source: 표시 언어
en: Display Language

source: 플레이그라운드
en: Playground

source: 홈
en: Home

source: 확인
en: Confirm

source: 환영합니다!
en: Welcome!

source: 레슨 0에서 본 상자에는 저마다 번호가 붙어 있었습니다. 그 번호를 주소라고 부릅니다.
en: Every box you saw in Lesson 0 has its own number. That number is called an address.

source: 포인터는 값을 복사해 오는 상자가 아니라, 그 값이 어디에 있는지를 적어 두는 상자입니다.
en: A pointer is not a box that copies a value. It is a box that writes down where the value is.

source: 그래서 포인터 칸에는 숫자 대신 `→ 0x700C`처럼 다른 칸의 번호가 들어갑니다.
en: So a pointer cell holds another cell's number, like `→ 0x700C`, instead of a plain number.

source: C로 쓰면 `int *p1 = &target;` 입니다. `*`는 이 상자에 주소가 들어간다는 표시이고, `&`는 주소를 알려 달라는 뜻입니다.
en: In C you write `int *p1 = &target;`. The `*` marks a box that holds an address, and the `&` asks for the address of something.

source: 값을 복사하지 않기 때문에, 같은 값을 여러 곳에서 함께 보고 함께 고칠 수 있습니다. 주소를 쓰는 이유가 여기에 있습니다.
en: Because nothing is copied, many places can look at the same value and change it together. That is why addresses matter.

source: 포인터도 메모리 한 칸을 차지합니다. 값이 든 상자와 똑같이 자기 주소를 가집니다.
en: A pointer takes up a cell in memory too. Just like a box holding a value, it has an address of its own.

source: 주소가 있다는 것은, 다른 포인터가 이 칸도 가리킬 수 있다는 뜻입니다.
en: Having an address means another pointer can point at this cell as well.

source: `ptr1`이 값을 가리키고 `p1`이 `ptr1`을 가리키면, `p1`은 이중 포인터입니다.
en: If `ptr1` points to a value and `p1` points to `ptr1`, then `p1` is a pointer to a pointer.

source: C로 쓰면 `int **p1 = &ptr1;` 입니다. `*`가 하나 늘어날 때마다 값에 닿기까지 한 번 더 따라가야 합니다.
en: In C you write `int **p1 = &ptr1;`. Each extra `*` means one more step to follow before you reach the value.

source: 포인터가 포인터를 가리킬 수 있으니, 이어 붙이면 길이 됩니다.
en: Since a pointer can point to a pointer, chaining them makes a path.

source: `start`에서 출발해 `nodeA`, `nodeB`를 거쳐야 `treasure`에 닿습니다.
en: You start at `start`, pass through `nodeA` and `nodeB`, and then reach `treasure`.

source: 각 칸은 다음 칸이 어디에 있는지만 알고 있습니다. 실제 값은 마지막 칸에만 있습니다.
en: Each cell only knows where the next cell is. The actual value lives only in the last cell.

source: 이렇게 이어진 구조를 연결 리스트라고 부릅니다. 이름은 지금 외우지 않아도 괜찮습니다.
en: A structure linked like this is called a linked list. You do not have to memorize the name yet.

source: 시작하기
en: Start

source: int **p1 = &ptr1; // ptr1(0x7014)을 가리키는 이중 포인터
en: int **p1 = &ptr1; // A double pointer pointing to ptr1(0x7014)
